app/Models/MenuModel.php

    public function getMenuCategory($menuCategoryID = false)
    {

        if ($menuCategoryID) {
            return $this->db->table('user_menu_category')->where(['id' => $menuCategoryID['id']])->get()->getRowArray();
        }
        return $this->db->table('user_menu_category')
            ->get()->getResultArray();
---
SELECT *
FROM `user_menu_category`

    public function getMenu($menuID = false)
    {
        if ($menuID) {
            return $this->db->table('user_menu')
                ->select(
                    '*,
                    user_menu_category.menu_category AS category,
                    user_menu.menu_category AS menu_category_id,
                    user_menu.id AS menu_id
                    '
                )
                ->join('user_menu_category', 'user_menu.menu_category = user_menu_category.id')
                ->where(['id' => $menuID['menu_id']])
                ->get()->getRowArray();
        }
        return $this->db->table('user_menu')
            ->select(
                '*,
                user_menu_category.menu_category AS category,
                user_menu.menu_category AS menu_category_id,
                user_menu.id AS menu_id
                '
            )
            ->join('user_menu_category', 'user_menu.menu_category = user_menu_category.id')
            ->get()->getResultArray();
---
SELECT *, `user_menu_category`.`menu_category` AS `category`, `user_menu`.`menu_category` AS `menu_category_id`, `user_menu`.`id` AS `menu_id`
FROM `user_menu`
JOIN `user_menu_category` ON `user_menu`.`menu_category` = `user_menu_category`.`id`

    public function getSubmenu()
    {
        return $this->db->table('user_submenu')
            ->select('*,
            user_menu.title AS menu_title,
            user_submenu.menu AS menu_id,
            user_submenu.id AS submenu_id,
            user_submenu.title AS submenu_title,
            user_submenu.url AS submenu_url,

            ')
            ->join('user_menu', 'user_submenu.menu = user_menu.id')
            ->join('user_menu_category', 'user_menu.menu_category = user_menu_category.id')
            ->get()->getResultArray();
---
SELECT *, `user_menu`.`title` AS `menu_title`, `user_submenu`.`menu` AS `menu_id`, `user_submenu`.`id` AS `submenu_id`, `user_submenu`.`title` AS `submenu_title`, `user_submenu`.`url` AS `submenu_url`
FROM `user_submenu`
JOIN `user_menu` ON `user_submenu`.`menu` = `user_menu`.`id`
JOIN `user_menu_category` ON `user_menu`.`menu_category` = `user_menu_category`.`id`

    public function getMenuByUrl($menuUrl)
    {
        return $this->db->table('user_menu')
            ->where(['url' => $menuUrl])
            ->get()->getRowArray();
---
SELECT *
FROM `user_menu`
WHERE `url` = 'users'